[
    {
        "code": "* {",
        "explanation": "Inicia uma regra CSS que aplica estilos a todos os elementos da página. O uso de '*' é um seletor universal que afeta todos os elementos HTML."
    },
    {
        "code": "margin: 0;",
        "explanation": "Remove a margem padrão de todos os elementos, garantindo que não haja espaçamento externo indesejado."
    },
    {
        "code": "padding: 0;",
        "explanation": "Remove o preenchimento padrão de todos os elementos, garantindo que não haja espaçamento interno indesejado."
    },
    {
        "code": "box-sizing: border-box;",
        "explanation": "Define que a largura e a altura dos elementos devem incluir o padding e a borda. Isso facilita o controle do layout, pois o tamanho total dos elementos não será maior do que o especificado."
    },
    {
        "code": "font-family: Arial, Helvetica, sans-serif;",
        "explanation": "Define a família de fontes para todos os elementos como Arial, com Helvetica e sans-serif como alternativas caso a fonte principal não esteja disponível."
    },
    {
        "code": "body {",
        "explanation": "Inicia uma regra CSS para o elemento <body>, que define o estilo para o conteúdo principal da página."
    },
    {
        "code": "width: 100vw;",
        "explanation": "Define a largura do elemento <body> para 100% da largura da viewport (tela visível do navegador), garantindo que o corpo da página ocupe toda a largura da tela."
    },
    {
        "code": "height: 100vh;",
        "explanation": "Define a altura do elemento <body> para 100% da altura da viewport, garantindo que o corpo da página ocupe toda a altura da tela."
    },
    {
        "code": "display: flex;",
        "explanation": "Define o layout do elemento <body> como flexível, permitindo o uso de propriedades de layout flexível para alinhar e distribuir os itens dentro do corpo da página."
    },
    {
        "code": "justify-content: center;",
        "explanation": "Centraliza horizontalmente os itens dentro do elemento <body> usando o layout flexível."
    },
    {
        "code": "background-color: #03152e;",
        "explanation": "Define a cor de fundo do elemento <body> como um tom escuro de azul (#03152e)."
    },
    {
        "code": "color: white;",
        "explanation": "Define a cor do texto dentro do elemento <body> como branca, garantindo um bom contraste com o fundo escuro."
    },
    {
        "code": "overflow-y: auto;",
        "explanation": "Adiciona uma barra de rolagem vertical ao elemento <body> se o conteúdo exceder a altura da viewport, permitindo rolar o conteúdo."
    },
    {
        "code": "text-align: center;",
        "explanation": "Centraliza horizontalmente o texto dentro do elemento <body>."
    },
    {
        "code": "main {",
        "explanation": "Inicia uma regra CSS para o elemento <main>, que geralmente contém o conteúdo principal da página."
    },
    {
        "code": "width: 500px;",
        "explanation": "Define a largura do elemento <main> como 500 pixels, centralizando o conteúdo e evitando que ele se estenda por toda a largura da tela."
    },
    {
        "code": "display: flex;",
        "explanation": "Define o layout do elemento <main> como flexível, permitindo a utilização de propriedades de layout flexível."
    },
    {
        "code": "justify-content: center;",
        "explanation": "Centraliza horizontalmente os itens dentro do elemento <main>."
    },
    {
        "code": "align-items: center;",
        "explanation": "Centraliza verticalmente os itens dentro do elemento <main>."
    },
    {
        "code": "flex-direction: column;",
        "explanation": "Organiza os itens dentro do elemento <main> em uma coluna, empilhando-os verticalmente."
    },
    {
        "code": "gap: 20px;",
        "explanation": "Define o espaçamento de 20 pixels entre os itens dentro do elemento <main>."
    },
    {
        "code": "divAltura, .divPeso, .divCalc {",
        "explanation": "Inicia uma regra CSS para os elementos com as classes 'divAltura', 'divPeso' e 'divCalc', que são usados para agrupar campos e botões."
    },
    {
        "code": "width: 90%;",
        "explanation": "Define a largura dos elementos com as classes especificadas como 90% da largura do elemento pai, permitindo que eles se ajustem ao layout de forma responsiva."
    },
    {
        "code": "display: flex;",
        "explanation": "Define o layout dos elementos com as classes especificadas como flexível, permitindo o uso de propriedades de layout flexível."
    },
    {
        "code": "flex-direction: column;",
        "explanation": "Organiza os itens dentro dos elementos com as classes especificadas em uma coluna, empilhando-os verticalmente."
    },
    {
        "code": "gap: 10px;",
        "explanation": "Define o espaçamento de 10 pixels entre os itens dentro dos elementos com as classes especificadas."
    },
    {
        "code": "input, button {",
        "explanation": "Inicia uma regra CSS para os elementos <input> e <button>, que são usados para entradas de dados e botões interativos."
    },
    {
        "code": "padding: 10px;",
        "explanation": "Define o preenchimento interno de 10 pixels para os elementos <input> e <button>, aumentando a área clicável e melhorando a usabilidade."
    },
    {
        "code": "font-size: 20px;",
        "explanation": "Define o tamanho da fonte para os elementos <input> e <button> como 20 pixels, aumentando a legibilidade do texto."
    },
    {
        "code": "outline: none;",
        "explanation": "Remove o contorno padrão que aparece ao focar nos elementos <input> e <button>, que pode ser substituído por outros estilos de foco."
    },
    {
        "code": "border: none;",
        "explanation": "Remove a borda padrão dos elementos <input> e <button>, permitindo que eles sejam estilizados com bordas personalizadas, se necessário."
    },
    {
        "code": "border-radius: 5px;",
        "explanation": "Define o raio da borda para 5 pixels, arredondando os cantos dos elementos <input> e <button> para um visual mais suave."
    },
    {
        "code": "button {",
        "explanation": "Inicia uma regra CSS específica para o elemento <button>, que é usado para criar botões interativos."
    },
    {
        "code": "cursor: pointer;",
        "explanation": "Altera o cursor para uma mão ao passar sobre o botão, indicando que ele é clicável."
    },
    {
        "code": "background-color: #6f00ff;",
        "explanation": "Define a cor de fundo do botão como um tom de roxo (#6f00ff)."
    },
    {
        "code": "color: white;",
        "explanation": "Define a cor do texto do botão como branca, proporcionando um bom contraste com a cor de fundo roxa."
    },
    {
        "code": "button:hover {",
        "explanation": "Inicia uma regra CSS para o estado de foco do botão quando o usuário passa o mouse sobre ele."
    },
    {
        "code": "background-color: #4b0082;",
        "explanation": "Define a cor de fundo do botão como um tom mais escuro de roxo (#4b0082) quando o botão é focado, proporcionando um efeito visual ao interagir com o botão."
    },
    {
        "code": "#contato {",
        "explanation": "Inicia uma regra CSS para o elemento com o id 'contato', que é usado para a seção de contatos."
    },
    {
        "code": "margin-top: 30px;",
        "explanation": "Define a margem superior do elemento com o id 'contato' como 30 pixels, criando espaço acima da seção."
    },
    {
        "code": "text-align: center;",
        "explanation": "Centraliza horizontalmente o texto dentro do elemento com o id 'contato'."
    },
    {
        "code": "#contato h3 {",
        "explanation": "Inicia uma regra CSS para o elemento <h3> dentro do elemento com o id 'contato'."
    },
    {
        "code": "font-size: 24px;",
        "explanation": "Define o tamanho da fonte do <h3> como 24 pixels, destacando o título da seção de contatos."
    },
    {
        "code": "margin-bottom: 10px;",
        "explanation": "Define a margem inferior do <h3> como 10 pixels, criando espaço abaixo do título da seção de contatos."
    },
    {
        "code": "#contato ul {",
        "explanation": "Inicia uma regra CSS para o elemento <ul> dentro do elemento com o id 'contato'."
    },
    {
        "code": "list-style: none;",
        "explanation": "Remove os marcadores padrão da lista, deixando-a sem estilo de lista."
    },
    {
        "code": "padding: 0;",
        "explanation": "Remove o preenchimento padrão do elemento <ul>, garantindo que não haja espaçamento interno indesejado."
    },
    {
        "code": "#contato li {",
        "explanation": "Inicia uma regra CSS para o elemento <li> dentro do elemento com o id 'contato'."
    },
    {
        "code": "font-size: 18px;",
        "explanation": "Define o tamanho da fonte dos itens da lista como 18 pixels, aumentando a legibilidade dos itens de contato."
    },
    {
        "code": "margin-bottom: 5px;",
        "explanation": "Define a margem inferior dos itens da lista como 5 pixels, criando espaço entre os itens da lista."
    },
    {
        "code": "#contato li a {",
        "explanation": "Inicia uma regra CSS para os links (<a>) dentro dos itens da lista no elemento com o id 'contato'."
    },
    {
        "code": "color: #0751f3;",
        "explanation": "Define a cor dos links como azul (#0751f3)."
    },
    {
        "code": "text-decoration: none;",
        "explanation": "Remove o sublinhado padrão dos links para um estilo mais limpo."
    },
    {
        "code": "transition: color 0.3s;",
        "explanation": "Adiciona uma transição suave de 0,3 segundos para a mudança de cor dos links, criando um efeito visual ao passar o mouse sobre eles."
    },
    {
        "code": "#contato li a:hover {",
        "explanation": "Inicia uma regra CSS para o estado de foco dos links dentro dos itens da lista quando o usuário passa o mouse sobre eles."
    },
    {
        "code": "color: #400080;",
        "explanation": "Define a cor dos links como um tom mais escuro de roxo (#400080) quando o usuário passa o mouse sobre eles."
    },
    {
        "code": "footer {",
        "explanation": "Inicia uma regra CSS para o elemento <footer>, que é usado para o rodapé da página."
    },
    {
        "code": "margin-top: 50px;",
        "explanation": "Define a margem superior do rodapé como 50 pixels, criando espaço acima do rodapé."
    },
    {
        "code": "text-align: center;",
        "explanation": "Centraliza horizontalmente o texto dentro do rodapé."
    },
    {
        "code": "font-size: 14px;",
        "explanation": "Define o tamanho da fonte do texto no rodapé como 14 pixels, tornando-o menor e menos destacado em relação ao conteúdo principal."
    },
    {
        "code": "color: #ccc;",
        "explanation": "Define a cor do texto no rodapé como cinza claro (#ccc), criando um contraste suave com o fundo escuro."
    },
    {
        "code": "background-color: #03152e;",
        "explanation": "Define a cor de fundo do rodapé como um tom escuro de azul (#03152e), combinando com o fundo do corpo da página."
    },
    {
        "code": "padding: 10px 0;",
        "explanation": "Define o preenchimento interno do rodapé como 10 pixels na parte superior e inferior, garantindo espaço interno adequado."
    },
    {
        "code": "width: 100%;",
        "explanation": "Define a largura do rodapé como 100% da largura da viewport, garantindo que ele ocupe toda a largura da tela."
    },
    {
        "code": "position: fixed;",
        "explanation": "Define a posição do rodapé como fixa, mantendo-o no fundo da tela enquanto o usuário rola a página."
    },
    {
        "code": "bottom: 0;",
        "explanation": "Define a distância do rodapé em relação ao fundo da tela como 0 pixels, fixando-o na parte inferior da viewport."
    },
    {
        "code": "footer p {",
        "explanation": "Inicia uma regra CSS para o elemento <p> dentro do rodapé."
    },
    {
        "code": "margin: 0;",
        "explanation": "Remove a margem padrão dos parágrafos dentro do rodapé, garantindo que não haja espaçamento adicional."
    },
    {
        "code": "footer a {",
        "explanation": "Inicia uma regra CSS para os links (<a>) dentro do rodapé."
    },
    {
        "code": "color: #6f00ff;",
        "explanation": "Define a cor dos links no rodapé como roxo (#6f00ff)."
    },
    {
        "code": "text-decoration: none;",
        "explanation": "Remove o sublinhado padrão dos links no rodapé para um estilo mais limpo."
    },
    {
        "code": "transition: color 0.3s;",
        "explanation": "Adiciona uma transição suave de 0,3 segundos para a mudança de cor dos links no rodapé, criando um efeito visual ao passar o mouse sobre eles."
    },
    {
        "code": "footer a:hover {",
        "explanation": "Inicia uma regra CSS para o estado de foco dos links no rodapé quando o usuário passa o mouse sobre eles."
    },
    {
        "code": "color: #400080;",
        "explanation": "Define a cor dos links no rodapé como um tom mais escuro de roxo (#400080) quando o usuário passa o mouse sobre eles."
    }
]
