[
    {
        "code": "<!DOCTYPE html>",
        "explanation": "Esta é a declaração do tipo de documento, que informa ao navegador que o arquivo é um documento HTML5. Ela deve ser a primeira linha do código HTML para garantir que o navegador interprete o conteúdo corretamente, utilizando os recursos mais recentes e evitando problemas de compatibilidade."
    },
    {
        "code": "<html lang=\"en\">",
        "explanation": "Inicia o documento HTML e define o idioma da página como inglês (en). O atributo lang é importante para acessibilidade e SEO, pois ajuda os navegadores e ferramentas de leitura de tela a entenderem o idioma do conteúdo, permitindo uma melhor experiência do usuário."
    },
    {
        "code": "<head>",
        "explanation": "Inicia a seção de cabeçalho do documento HTML. Esta seção contém meta-informações, links para arquivos externos e outros elementos que não são exibidos diretamente na página."
    },
    {
        "code": "<meta charset=\"UTF-8\">",
        "explanation": "Define a codificação de caracteres para o documento como UTF-8, que é um padrão de codificação de caracteres que suporta uma ampla gama de símbolos e idiomas, garantindo que todos os caracteres sejam exibidos corretamente."
    },
    {
        "code": "<meta http-equiv=\"X-UA-Compatible\" content=\"IE=edge\">",
        "explanation": "Informa ao Internet Explorer para usar a versão mais recente do motor de renderização. Isso ajuda a evitar que o navegador use modos de compatibilidade mais antigos que podem não suportar as tecnologias mais recentes."
    },
    {
        "code": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">",
        "explanation": "Define as configurações da viewport para dispositivos móveis, garantindo que o layout da página seja responsivo e se ajuste ao tamanho da tela do dispositivo, com um zoom inicial de 1.0."
    },
    {
        "code": "<title>Calculadora de IMC deValeCode</title>",
        "explanation": "Define o título da página que será exibido na aba do navegador. O título é importante para SEO e para fornecer aos usuários uma indicação clara do conteúdo da página."
    },
    {
        "code": "<link rel=\"stylesheet\" href=\"style.css\">",
        "explanation": "Inclui o arquivo CSS externo 'style.css' para estilizar a página. O atributo rel=\"stylesheet\" indica que o arquivo é uma folha de estilo, e o atributo href especifica o caminho para o arquivo."
    },
    {
        "code": "</head>",
        "explanation": "Fecha a seção de cabeçalho do documento HTML."
    },
    {
        "code": "<body>",
        "explanation": "Inicia a seção principal do documento HTML, que contém o conteúdo visível da página, como texto, imagens e botões."
    },
    {
        "code": "<main>",
        "explanation": "Define o conteúdo principal da página. O elemento <main> é usado para envolver o conteúdo central da página, excluindo o cabeçalho, rodapé e barras laterais."
    },
    {
        "code": "<h2>Calculadora de IMC</h2>",
        "explanation": "Define um título de nível 2 para a página. O elemento <h2> é usado para subtítulos e é importante para a estrutura hierárquica do conteúdo e para SEO."
    },
    {
        "code": "<p>A calculadora de Índice de Massa Corporal (IMC) é uma ferramenta simples e útil para avaliar se o seu peso está dentro de uma faixa saudável em relação à sua altura...</p>",
        "explanation": "Fornece uma descrição sobre o propósito da calculadora de IMC, explicando como ela pode ser usada para avaliar a saúde com base no peso e altura."
    },
    {
        "code": "<div class=\"divAltura\">",
        "explanation": "Inicia uma <div> com a classe 'divAltura', usada para agrupar e estilizar o campo de entrada para a altura."
    },
    {
        "code": "<label for=\"altura\">Altura (M)</label>",
        "explanation": "Define um rótulo para o campo de entrada da altura. O atributo 'for' associa o rótulo ao campo de entrada com o id correspondente."
    },
    {
        "code": "<input type=\"number\" id=\"altura\" />",
        "explanation": "Cria um campo de entrada do tipo número para o usuário inserir sua altura. O atributo id é usado para associar o campo ao rótulo."
    },
    {
        "code": "</div>",
        "explanation": "Fecha a <div> com a classe 'divAltura'."
    },
    {
        "code": "<div class=\"divPeso\">",
        "explanation": "Inicia uma <div> com a classe 'divPeso', usada para agrupar e estilizar o campo de entrada para o peso."
    },
    {
        "code": "<label for=\"peso\">Peso (Kg)</label>",
        "explanation": "Define um rótulo para o campo de entrada do peso. O atributo 'for' associa o rótulo ao campo de entrada com o id correspondente."
    },
    {
        "code": "<input type=\"number\" id=\"peso\" />",
        "explanation": "Cria um campo de entrada do tipo número para o usuário inserir seu peso. O atributo id é usado para associar o campo ao rótulo."
    },
    {
        "code": "</div>",
        "explanation": "Fecha a <div> com a classe 'divPeso'."
    },
    {
        "code": "<div class=\"divCalc\">",
        "explanation": "Inicia uma <div> com a classe 'divCalc', usada para agrupar e estilizar o botão de cálculo."
    },
    {
        "code": "<button onclick=\"calcIMC()\">Calcular</button>",
        "explanation": "Cria um botão que, ao ser clicado, executa a função JavaScript 'calcIMC()' para calcular o IMC com base na altura e peso fornecidos pelo usuário."
    },
    {
        "code": "</div>",
        "explanation": "Fecha a <div> com a classe 'divCalc'."
    },
    {
        "code": "<span id=\"resultado\"></span>",
        "explanation": "Cria um elemento <span> com o id 'resultado', que será usado para exibir o resultado do cálculo do IMC."
    },
    {
        "code": "<section id=\"contato\">",
        "explanation": "Inicia uma seção com o id 'contato', usada para exibir informações de contato."
    },
    {
        "code": "<h3>Contatos:</h3>",
        "explanation": "Define um título de nível 3 para a seção de contatos."
    },
    {
        "code": "<ul>",
        "explanation": "Inicia uma lista não ordenada para listar os links de contato."
    },
    {
        "code": "<li><a href=\"https://www.linkedin.com/in/diego-vale-do-nascimento-48212215b/\" target=\"_blank\" class=\"linkedin\">LinkedIn</a></li>",
        "explanation": "Cria um item de lista com um link para o perfil do LinkedIn de Diego Nascimento. O atributo target=\"_blank\" faz com que o link abra em uma nova aba, e a classe 'linkedin' pode ser usada para estilização."
    },
    {
        "code": "<li><a href=\"https://github.com/DVALENASCIMENTO\" target=\"_blank\" class=\"github\">GitHub</a></li>",
        "explanation": "Cria um item de lista com um link para o perfil do GitHub de Diego Nascimento. O atributo target=\"_blank\" faz com que o link abra em uma nova aba, e a classe 'github' pode ser usada para estilização."
    },
    {
        "code": "</ul>",
        "explanation": "Fecha a lista não ordenada."
    },
    {
        "code": "</section>",
        "explanation": "Fecha a seção com o id 'contato'."
    },
    {
        "code": "<footer>",
        "explanation": "Inicia o rodapé da página, que geralmente contém informações sobre o autor ou direitos autorais."
    },
    {
        "code": "<p>Diego Nascimento - Tecnólogo em Análise e Desenvolvimento de Sistemas</p>",
        "explanation": "Fornece informações sobre o autor da página, incluindo o nome e a formação acadêmica."
    },
    {
        "code": "</footer>",
        "explanation": "Fecha o rodapé da página."
    },
    {
        "code": "<script src=\"script.js\"></script>",
        "explanation": "Inclui o arquivo JavaScript externo 'script.js' que contém o código necessário para a funcionalidade da calculadora. O atributo src especifica o caminho para o arquivo."
    },
    {
        "code": "</body>",
        "explanation": "Fecha a seção principal do corpo do documento HTML."
    },
    {
        "code": "</html>",
        "explanation": "Fecha o documento HTML."
    }
]
